<template>
  <main class="container shadow bg-white">
    <div class="jumbotron">
      <h1>あんにゃもんにゃのルール</h1>
      <hr>
      <h2>概要</h2>
      <p style="text-indent: 1em;">
        「あんにゃもんにゃ」は，奇っ怪な生物が描かれたカードを次々とめくって行き，彼らに名前をつけてあげるゲームである．
        すでに名前がつけられた生物が現れたら，彼の名前をいち早くタイピングし，ポイントを得ることができる．
        すべてのカードがめくられたとき，もっともポイントを稼いでるプレイヤーが勝利となる．
        カードの種類はゲーム開始時に抽選され，毎ゲーム違うキャラクターが現れる．
      </p>
    </div>
    <h3 class="topic">手順</h3>
    <ol>
      <li>ランダムに選ばれたプレイヤーからゲームがスタートする</li>
      <li>自分の手番となったプレイヤーがカードをめくる</li>
      <li>表示されたカードが，そのゲームで初めて見るカードであれば，そのカードの特徴に見合った名前をつける</li>
      <li>表示されたカードがすでに名付けられたカードであれば，その名前をタイピングする．</li>
      <li>一番正解できたプレイヤーが，それまでめくられて積まれているカードを総取りできる</li>
      <li>以上を繰り返し，山札がなくなったときに一番カードを集められたプレイヤーの勝利となる</li>
    </ol>
    <h3 class="mt-3 topic">元ネタ</h3>
    <p class="pb-5 px-3" style="text-indent: 1em;">
      あんにゃもんにゃの元となったゲームはЛебедева Алёна (リーべディバ・アリョーナ)さん考案のナンジャモンジャというゲームである．
      「ナンジャモンジャ」と「あんにゃもんにゃ」のルールの相違は，名前を叫ぶのではなくタイピングするという点と，ゲームごとに抽選されるカードの種類が異なるということである．
      つまり，プレイする度に現れるキャラクターが変わっていくため，繰り返し遊んでもワンパターンになりにくいという利点がある．
    </p>
  </main>
</template>

<script>
export default {
}
</script>

<style>
.topic {
  color: #404040;
  border-left: solid 6px #1fa67a;
  border-bottom: solid 2px #dadada;
  background: whitesmoke;
  margin-bottom: 1rem;
  line-height: 1;
  padding: 0.3em;
}
</style>
